/*# bfs-lanqiao-2019A4B5
题目描述

本题为填空题，只需要算出结果后，在代码中使用输出语句将所填结果输出即可。

下图给出了一个迷宫的平面图，其中标记为 1 的为障碍，标记为 0 的为可以通行的地方。

010000
000100
001001
110000

迷宫的入口为左上角，出口为右下角，在迷宫中，只能从一个位置走到这 个它的上、下、左、右四个方向之一。

对于上面的迷宫，从入口开始，可以按 DRRURRDDDR 的顺序通过迷宫， 一共 10 步。其中D、U、L、R 分别表示向下、向上、向左、向右走。
对于下面这个更复杂的迷宫（30 行 50 列），请找出一种通过迷宫的方式，其使用的步数最少，在步数最少的前提下，请找出字典序最小的一个作为答案。

请注意在字典序中 D<L<R<U。

01010101001011001001010110010110100100001000101010
00001000100000101010010000100000001001100110100101
01111011010010001000001101001011100011000000010000
01000000001010100011010000101000001010101011001011
00011111000000101000010010100010100000101100000000
11001000110101000010101100011010011010101011110111
00011011010101001001001010000001000101001110000000
10100000101000100110101010111110011000010000111010
00111000001010100001100010000001000101001100001001
11000110100001110010001001010101010101010001101000
00010000100100000101001010101110100010101010000101
11100100101001001000010000010101010100100100010100
00000010000000101011001111010001100000101010100011
10101010011100001000011000010110011110110100001000
10101010100001101010100101000010100000111011101001
10000000101100010000101100101101001011100000000100
10101001000000010100100001000100000100011110101001
00101001010101101001010100011010101101110000110101
11001010000100001100000010100101000001000111000010
00001000110000110101101000000100101001001000011101
10100101000101000000001110110010110101101010100001
00101000010000110101010000100010001001000100010101
10100001000110010001000010101001010101011111010010
00000100101000000110010100101001000001000000000010
11010000001001110111001001000011101001011011101000
00000110100010001000100000001000011101000000110011
10101000101000100010001111100010101001010000001000
10000010100101001010110000000100101010001011101000
00111100001000010000000110111000000001000000001011
10000001100111010111010001000110111010101101111000

运行限制

最大运行时间：1s
最大运行内存: 256M
*/
//
//  main.cpp
//  C++ program
//
//  Created by 木林 on 2023/2/2.
//

#include <iostream>
#include <string>
#include <fstream>
#include <vector>
using namespace std;

#define END_X 30//地图边界
#define END_Y 50
string min_path;
int minn=0x7fffffff;//最短路径长度
int map[60][60];//1为障碍物，0可以通行
int vis[60][60]={0};//是否已访问
int start_x=0,start_y=0,end_x=END_X-1,end_y=END_Y-1;//起点与终点坐标
int head=1,tail=2;//队列的两个指针
int next_x,next_y;//下一个点的坐标（见后文）
bool flag=0;//终点判断
char cvt[3][3]={'0','U','0',
    'L','0','R',
    '0','D','0'
};
struct que{
    que(int a,int b,int c,int d):x(a),y(b),dis(c),from(d){}
    int x,y,dis,from;
};
vector<que> q;

bool is_legal(int x,int y){
    if(x<0||y<0||x>=END_X||y>=END_Y){
        return 0;
    }
    return 1;
}

int main(int argc, const char * argv[]) {
    ifstream ifs;
    ifs.open("map.txt",ios::in);//打开地图

    que t={start_x,start_y,0,0};//第0个队列不需要，从1开始
    q.push_back(t);
    q.push_back(t);
    vis[start_x][start_y]=1;//起点一定已访问
    
    for(int i=0;i<END_X;i++){
        for(int j=0;j<END_Y;j++){
            char c;
            ifs>>c;
            if(c=='\n')ifs>>c;
            map[i][j]=(int)(c-'0');//由于我用的地图是字符串形式，所以这么读取
        }
    }
    
    while(head<tail){
        for(int ctrl=0;ctrl<4;ctrl++){
            switch (ctrl)
            {
                case 0://D，向下
                {
                    next_x=q[head].x+1;
                    next_y=q[head].y;
                    break;
                }
                case 1://L,向左
                {
                    next_x=q[head].x;
                    next_y=q[head].y-1;
                    break;
                }
                case 2://R,向右
                {
                    next_x=q[head].x;
                    next_y=q[head].y+1;
                    break;
                }
                case 3://U,向上
                {
                    next_x=q[head].x-1;
                    next_y=q[head].y;
                    break;
                }
            }
            if(is_legal(next_x, next_y)&&!vis[next_x][next_y]&&!map[next_x][next_y])
            {
                que tmp(next_x,next_y,q[head].dis+1,head);
                q.push_back(tmp);
                vis[next_x][next_y]=1;
                tail++;
            }
            if(next_x==END_X-1&&next_y==END_Y-1){
                flag=1;
                break;
            }
        }
        if(flag){
            break;
        }
        head++;
    }
    //cout<<q[tail-1].dis<<endl;
    int present=tail-1;
    int before=q[present].from;
    while(before!=0){
        int mi_x=q[present].x-q[before].x+1;
        int mi_y=q[present].y-q[before].y+1;
        min_path+=cvt[mi_x][mi_y];
        present=before;
        before=q[before].from;
    }
    for(long i=min_path.length()-1;i>=0;i--){
        cout<<min_path[i];
    }
    return 0;
}
